app/controllers/species_controller.rb

SELECT "species".* FROM "species"
SELECT COUNT(*) FROM "species" WHERE (name='Raccoon')
INSERT INTO "species" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Raccoon"], ["created_at", "2016-06-10 22:09:42.869353"], ["updated_at", "2016-06-10 22:09:42.869353"]]
---
  def view

    @all_species = Species.all

    #no params -- no nothing
    #empty param
    #valid param
    #taken param

    if params[:species].nil?
      @all_species = Species.all
    elsif params[:species].strip.empty?
      redirect_to '/'
    else
      species_name = params[:species].capitalize
      if Species.where("name='#{species_name}'").count == 0
        @species = Species.create!(name:species_name)